------------------------------------------------------------------------------------------------------------------------------

/*
    1. Формируем календарь на месяц (К какой недели и к какому дню недели относится дата).
    2. Собираем все документы (дневник, ИППСУ и дополнение), периоды которых пересекаются с месяцем.
    3. Извлекаем все сведения об услугах из дополнения ИППСУ.
    4. Составляем календарь с неделями и днями услуг из дополнения, генерируя план на месяц (учитывая дату начала и окончания документов)
    5. Грузим сгенерированный план в таблицу.
*/

------------------------------------------------------------------------------------------------------------------------------
